Revit 2027 API
AssetProperty.Type Property
Returns the type of the AssetProperty
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AssetPropertyType Type { get; }
Public ReadOnly Property Type As AssetPropertyType
	Get
public:
property AssetPropertyType Type {
	AssetPropertyType get ();
}
member Type : AssetPropertyType with get
Property Value
AssetPropertyType
See Also
Reference
AssetProperty Class
Autodesk.Revit.DB.Visual Namespace